%---- Коорд-ты левого верхнего угла ----
y1 = 60.0994205474854;
x1 = 29.5567417144775;
 
%---- Коорд-ты пр. ниж. угла ----
y2 = 59.8077678680420;
x2 = 30.3299045562744;
 

D = [59.8850000000000 30.1666666666667 11.2500000000000;
     59.9083333333333 29.9366666666667 13.8000001900000; 
     59.9900000000000 29.8583333333333 13.8999996200000; 
     59.9583333333333 29.7966666666667 15.6999998100000; 
     59.9366666666667 29.7883333333333 6.30999994300000; 
     60 29.9383333333333 12.5000000000000; 
     59.9383333333333 30.1283333333333 15.4200000800000; 
     59.9016666666667 30.0866666666667 35.2000007600000];
 
n = 3500;
k = 3500;
%---- Кол-во опорных точек ----
p = 8;
 
stepX = (x2 - x1) / n;
stepY = (y2 - y1) / k;
 
%---- Массив коорд-т точек сетки по X ----
mX = [];
%---- Массив коорд-т точек сетки по Y ----
mY = [];
 
for i = 1:n
    for j = 1:k
        mX(i) = x1 + i * stepX;
        mY(j) = y1 + j * stepY; 
    end
end


% create random field with autocorrelation
[X,Y] = meshgrid(mX,mY);


%---- Цикл проверки кросс-валидации ----
for a = 1:p
    
    %Текущая точка
    y_test = D(a,1);
    x_test = D(a,2);
    z_test = D(a,3);
    
    x = D(:,2);
    y = D(:,1);
    z = D(:,3);
    
    %Удаление текущей точки
    x(a,:)=[];
    y(a,:)=[];
    z(a,:)=[];
        
    v = variogram([x y],z,'plotit',false,'maxdist',100);
    [dum,dum,dum,vstruct] = variogramfit(v.distance,v.val,[],[],[],'model','stable');

    % now use the sampled locations in a kriging
    [Z,Zvar] = kriging(vstruct,x,y,z,X,Y);

    
    %Поиск в регулярной сетке ближайщей точки к иследуемой
    for i = 1:n
        if((X(1,i) >= (x_test-0.00011)) && (X(1,i) <= (x_test+0.00011)))           
            ii=i;
        end
    end
    for j = 1:k
        if((Y(j,1) >= (y_test-0.00011)) && (Y(j,1) <= (y_test+0.00011)))
            jj=j;
        end
    end
    
    disp(Z(jj,ii));
    d(1,a) = abs(z_test - Z(jj,ii)); %Разница
    disp('________________')  
end

disp(sum(d(1,:))/p); %Среднее значение
disp(var(d(1,:))); %Дисперсия